export const wordsForElasticEntititesCounter = `
Москва, moscow
петербург, питер, ленинград
Новосибирск, новосиб
Екатеринбург
Казань
Новгород
Красноярск
Челябинск
Самара
Уфа
Ростов-на-Дону, ростов
Краснодар
Омск
Воронеж
Пермь
Волгоград
Саратов
Тюмень
Тольятти
Барнаул
Махачкала
Ижевск
Хабаровск
Ульяновск
Иркутск
Владивосток
Ярославль
Севастополь
Томск
Ставрополь
Кемерово
Набережные Челны
Оренбург
Новокузнецк
Балашиха
Рязань
Чебоксары
Пенза
Липецк
Калининград
Киров
Астрахань
Тула
Сочи
Улан-Удэ
Курск
Тверь
Магнитогорск
Сургут
Брянск
Вятка
`
