export const ru = {
  message: {
    channelUnlinked: 'Канал успешно отвязан.',
    memePostedSuccessfully: 'Мем успешно опубликован.',
    adminRightForPost:
      'Для публикации мема в канал необходмо предоставить боту админ-права на отправку сообщений в данный канал.',
    checkChannelNameFormat:
      'Пожалуйста, проверьте корректность названия. Формат: @name или https://t.me/name',
    checkChannelName: `Убедитесь в корректности введенного названия.
Ожидаю повторной отправки.`,
    addedUserInsteadOfChannel: `
Для того, чтобы подписаться самому, выберите в главном меню кнопку "Добавить себя".
Вернитесь назад в главное меню или отправьте название канала.`,
    botMustBeInTheChannelAndHaveAdminRights: `Необходимо добавить бота в канал и предоставить админ-права.`,
    onlyAdminCanSubscribeChannel: `
Добавить подписку на канал может только администратор канала.
Если вы хотите только подписаться на мемы, то вернитесь назад в главном меню и выберите соответствующий пункт.`,
    botMustHaveAdminRights: `Для публикации в канал боту необходимо предоставить админ-права.`,
  },
}
